RhinoInside.Revit API Documentation
GeometryDecoder.ToBox Method
 Converts the specified BoundingBoxXYZ to an equivalent Rhino Box.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static Box ToBox(
	this BoundingBoxXYZ value
)
Parameters
value
Type: BoundingBoxXYZ
A value to convert.
Return Value
Type: Box
A Rhino Box that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BoundingBoxXYZ. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace